# FabricationMaterialAbbreviation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationMaterialAbbreviation Property
ParameterTypeId Class See Also
---
"Material Abbreviation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationMaterialAbbreviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationMaterialAbbreviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationMaterialAbbreviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace